---
kind: property
id: P:Autodesk.Revit.DB.Structure.LineLoad.EndPoint
source: html/55965bc2-8cc9-1609-2a9a-0566e478d97d.htm
---
# Autodesk.Revit.DB.Structure.LineLoad.EndPoint Property

Returns the three dimensional location of the end point for the line load.

## Syntax (C#)
```csharp
public XYZ EndPoint { get; }
```

## Remarks
The location of the end point is measured in decimal feet.